In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/017.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                     3                   4
0       NaN  NaN  NaN  Kingston (R)  94,961  Nelson (D)  43,668
1       NaN  NaN  NaN                 68.5%               31.5%
2    County   PR   TP                   NaN                 NaN
3   APPLING   19   19                  2992                1083
4  ATKINSON    6    6                   915                 511

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4
3   APPLING  19  19  2992  1083
4  ATKINSON   6   6   915   511
5     BACON   7   7  1752   519
6   BERRIEN  11  11  2351  1209
7  BRANTLEY  11  11  2120   773

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4
3   APPLING  2992  1083
4  ATKINSON   915   511
5     BACON  1752   519
6   BERRIEN  2351  1209
7  BRANTLEY  2120   773

In [9]:
df.columns = ['county', 'Jack Kingston', 'Jim Nelson']

In [10]:
df.tail(5)

     county Jack Kingston Jim Nelson
23   PIERCE          3021        686
24  TELFAIR          1105       1111
25     WARE          4404       2151
26    WAYNE          4749       1741
27  WHEELER           612        477

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county      candidate votes
0   APPLING  Jack Kingston  2992
1  ATKINSON  Jack Kingston   915
2     BACON  Jack Kingston  1752
3   BERRIEN  Jack Kingston  2351
4  BRANTLEY  Jack Kingston  2120

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
county       50 non-null object
candidate    50 non-null object
votes        50 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.2+ KB

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '1'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Jack Kingston', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Jim Nelson', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Jack Kingston  Republican    94961
Jim Nelson     Democrat      43668
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party      candidate  votes
0   APPLING  U.S. Representative        1  Republican  Jack Kingston   2992
1  ATKINSON  U.S. Representative        1  Republican  Jack Kingston    915
2     BACON  U.S. Representative        1  Republican  Jack Kingston   1752
3   BERRIEN  U.S. Representative        1  Republican  Jack Kingston   2351
4  BRANTLEY  U.S. Representative        1  Republican  Jack Kingston   2120

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')